tanakamasayuki/ESP32KeyBridge/src/ESP32KeyBridge.cpp
#include "ESP32KeyBridge.h"

namespace esp32keybridge
{

namespace
{
constexpr uint16_t kKeyboardModifierFirst = 0xe0;
constexpr uint16_t kKeyboardModifierLast = 0xe7;

constexpr uint16_t U(KeyboardUsage usage)
{
  return static_cast<uint16_t>(usage);
}

// clang-format off
const KeyboardLayoutEntry kEnUsEntries[] = {
    {U(KeyboardUsage::A), 'a', 'A', true}, {U(KeyboardUsage::B), 'b', 'B', true},
    {U(KeyboardUsage::C), 'c', 'C', true}, {U(KeyboardUsage::D), 'd', 'D', true},
    {U(KeyboardUsage::E), 'e', 'E', true}, {U(KeyboardUsage::F), 'f', 'F', true},
    {U(KeyboardUsage::G), 'g', 'G', true}, {U(KeyboardUsage::H), 'h', 'H', true},
    {U(KeyboardUsage::I), 'i', 'I', true}, {U(KeyboardUsage::J), 'j', 'J', true},
    {U(KeyboardUsage::K), 'k', 'K', true}, {U(KeyboardUsage::L), 'l', 'L', true},
    {U(KeyboardUsage::M), 'm', 'M', true}, {U(KeyboardUsage::N), 'n', 'N', true},
    {U(KeyboardUsage::O), 'o', 'O', true}, {U(KeyboardUsage::P), 'p', 'P', true},
    {U(KeyboardUsage::Q), 'q', 'Q', true}, {U(KeyboardUsage::R), 'r', 'R', true},
    {U(KeyboardUsage::S), 's', 'S', true}, {U(KeyboardUsage::T), 't', 'T', true},
    {U(KeyboardUsage::U), 'u', 'U', true}, {U(KeyboardUsage::V), 'v', 'V', true},
    {U(KeyboardUsage::W), 'w', 'W', true}, {U(KeyboardUsage::X), 'x', 'X', true},
    {U(KeyboardUsage::Y), 'y', 'Y', true}, {U(KeyboardUsage::Z), 'z', 'Z', true},
    {U(KeyboardUsage::Digit1), '1', '!', false}, {U(KeyboardUsage::Digit2), '2', '@', false},
    {U(KeyboardUsage::Digit3), '3', '#', false}, {U(KeyboardUsage::Digit4), '4', '$', false},
    {U(KeyboardUsage::Digit5), '5', '%', false}, {U(KeyboardUsage::Digit6), '6', '^', false},
    {U(KeyboardUsage::Digit7), '7', '&', false}, {U(KeyboardUsage::Digit8), '8', '*', false},
    {U(KeyboardUsage::Digit9), '9', '(', false}, {U(KeyboardUsage::Digit0), '0', ')', false},
    {U(KeyboardUsage::Space), ' ', 0, false},
    {U(KeyboardUsage::Minus), '-', '_', false},
    {U(KeyboardUsage::Equal), '=', '+', false},
    {U(KeyboardUsage::LeftBracket), '[', '{', false},
    {U(KeyboardUsage::RightBracket), ']', '}', false},
    {U(KeyboardUsage::Backslash), '\\', '|', false},
    {U(KeyboardUsage::Semicolon), ';', ':', false},
    {U(KeyboardUsage::Quote), '\'', '"', false},
    {U(KeyboardUsage::Grave), '`', '~', false},
    {U(KeyboardUsage::Comma), ',', '<', false},
    {U(KeyboardUsage::Period), '.', '>', false},
    {U(KeyboardUsage::Slash), '/', '?', false},
};

// JIS layout as interpreted by a ja_jp host (Windows 106/109). The Grave key
// is Zenkaku/Hankaku (no character) and International2/4/5 are IME keys, so
// they are not in the table.
const KeyboardLayoutEntry kJaJpEntries[] = {
    {U(KeyboardUsage::A), 'a', 'A', true}, {U(KeyboardUsage::B), 'b', 'B', true},
    {U(KeyboardUsage::C), 'c', 'C', true}, {U(KeyboardUsage::D), 'd', 'D', true},
    {U(KeyboardUsage::E), 'e', 'E', true}, {U(KeyboardUsage::F), 'f', 'F', true},
    {U(KeyboardUsage::G), 'g', 'G', true}, {U(KeyboardUsage::H), 'h', 'H', true},
    {U(KeyboardUsage::I), 'i', 'I', true}, {U(KeyboardUsage::J), 'j', 'J', true},
    {U(KeyboardUsage::K), 'k', 'K', true}, {U(KeyboardUsage::L), 'l', 'L', true},
    {U(KeyboardUsage::M), 'm', 'M', true}, {U(KeyboardUsage::N), 'n', 'N', true},
    {U(KeyboardUsage::O), 'o', 'O', true}, {U(KeyboardUsage::P), 'p', 'P', true},
    {U(KeyboardUsage::Q), 'q', 'Q', true}, {U(KeyboardUsage::R), 'r', 'R', true},
    {U(KeyboardUsage::S), 's', 'S', true}, {U(KeyboardUsage::T), 't', 'T', true},
    {U(KeyboardUsage::U), 'u', 'U', true}, {U(KeyboardUsage::V), 'v', 'V', true},
    {U(KeyboardUsage::W), 'w', 'W', true}, {U(KeyboardUsage::X), 'x', 'X', true},
    {U(KeyboardUsage::Y), 'y', 'Y', true}, {U(KeyboardUsage::Z), 'z', 'Z', true},
    {U(KeyboardUsage::Digit1), '1', '!', false}, {U(KeyboardUsage::Digit2), '2', '"', false},
    {U(KeyboardUsage::Digit3), '3', '#', false}, {U(KeyboardUsage::Digit4), '4', '$', false},
    {U(KeyboardUsage::Digit5), '5', '%', false}, {U(KeyboardUsage::Digit6), '6', '&', false},
    {U(KeyboardUsage::Digit7), '7', '\'', false}, {U(KeyboardUsage::Digit8), '8', '(', false},
    {U(KeyboardUsage::Digit9), '9', ')', false}, {U(KeyboardUsage::Digit0), '0', 0, false},
    {U(KeyboardUsage::Space), ' ', 0, false},
    {U(KeyboardUsage::Minus), '-', '=', false},
    {U(KeyboardUsage::Equal), '^', '~', false},
    {U(KeyboardUsage::LeftBracket), '@', '`', false},
    {U(KeyboardUsage::RightBracket), '[', '{', false},
    {U(KeyboardUsage::NonUsHash), ']', '}', false},
    {U(KeyboardUsage::Semicolon), ';', '+', false},
    {U(KeyboardUsage::Quote), ':', '*', false},
    {U(KeyboardUsage::Comma), ',', '<', false},
    {U(KeyboardUsage::Period), '.', '>', false},
    {U(KeyboardUsage::Slash), '/', '?', false},
    {U(KeyboardUsage::International1), '\\', '_', false},
    {U(KeyboardUsage::International3), 0x00a5, '|', false}, // Yen sign
};
// clang-format on

bool nameEquals(const char *a, const char *b)
{
  if (a == nullptr || b == nullptr)
  {
    return false;
  }
  size_t i = 0;
  while (a[i] != '\0' && b[i] != '\0')
  {
    if (a[i] != b[i])
    {
      return false;
    }
    ++i;
  }
  return a[i] == b[i];
}
} // namespace

KeyboardLayout::KeyboardLayout()
    : entries_(kEnUsEntries), count_(sizeof(kEnUsEntries) / sizeof(kEnUsEntries[0])),
      name_("en_us")
{
}

KeyboardLayout::KeyboardLayout(const KeyboardLayoutEntry *entries, size_t count, const char *layoutName)
    : entries_(entries), count_(count), name_(layoutName)
{
}

KeyboardLayout KeyboardLayout::enUs()
{
  return KeyboardLayout();
}

KeyboardLayout KeyboardLayout::jaJp()
{
  return KeyboardLayout(kJaJpEntries, sizeof(kJaJpEntries) / sizeof(kJaJpEntries[0]), "ja_jp");
}

KeyboardLayout KeyboardLayout::byName(const char *name, bool *found)
{
  if (nameEquals(name, "ja_jp"))
  {
    if (found != nullptr)
    {
      *found = true;
    }
    return jaJp();
  }
  const bool isEnUs = nameEquals(name, "en_us");
  if (found != nullptr)
  {
    *found = isEnUs;
  }
  return enUs();
}

bool KeyboardLayout::encode(char32_t codepoint, KeyStroke &stroke) const
{
  if (codepoint == 0)
  {
    return false;
  }
  for (size_t i = 0; i < count_; ++i)
  {
    if (entries_[i].base == codepoint)
    {
      stroke.key = keyboardKey(entries_[i].usage);
      stroke.shift = false;
      return true;
    }
  }
  for (size_t i = 0; i < count_; ++i)
  {
    if (entries_[i].shift == codepoint)
    {
      stroke.key = keyboardKey(entries_[i].usage);
      stroke.shift = true;
      return true;
    }
  }
  return false;
}

char32_t KeyboardLayout::decode(Key key, bool shift) const
{
  if (key.kind != KeyKind::Keyboard)
  {
    return 0;
  }
  for (size_t i = 0; i < count_; ++i)
  {
    if (entries_[i].usage == key.code)
    {
      return shift ? entries_[i].shift : entries_[i].base;
    }
  }
  return 0;
}

bool KeyboardLayout::capsAffects(Key key) const
{
  if (key.kind != KeyKind::Keyboard)
  {
    return false;
  }
  for (size_t i = 0; i < count_; ++i)
  {
    if (entries_[i].usage == key.code)
    {
      return entries_[i].capsAffects;
    }
  }
  return false;
}

const char *KeyboardLayout::name() const
{
  return name_;
}

bool isValid(Key key)
{
  if (key.kind == KeyKind::None)
  {
    return false;
  }
  if (key.code == 0)
  {
    return false;
  }
  return true;
}

const char *keyKindName(KeyKind kind)
{
  switch (kind)
  {
  case KeyKind::None:
    return "none";
  case KeyKind::Keyboard:
    return "keyboard";
  case KeyKind::Consumer:
    return "consumer";
  case KeyKind::MouseButton:
    return "mouse_button";
  case KeyKind::Virtual:
    return "virtual";
  }
  return "unknown";
}

