tanakamasayuki/ESP32KeyBridge/src/ESP32KeyBridge.cpp
bool isKeyboardModifier(Key key)
{
  return key.kind == KeyKind::Keyboard && key.code >= kKeyboardModifierFirst &&
         key.code <= kKeyboardModifierLast;
}

uint8_t keyboardModifierMask(Key key)
{
  if (!isKeyboardModifier(key))
  {
    return 0;
  }
  return static_cast<uint8_t>(1u << (key.code - kKeyboardModifierFirst));
}

Key keyboardModifierFromBitIndex(uint8_t bitIndex)
{
  if (bitIndex > 7)
  {
    return Key();
  }
  return keyboardKey(static_cast<uint16_t>(kKeyboardModifierFirst + bitIndex));
}

void KeySet::clear()
{
  count_ = 0;
}

bool KeySet::press(Key key)
{
  if (!esp32keybridge::isValid(key))
  {
    return false;
  }
  if (contains(key))
  {
    return true;
  }
  if (count_ >= MaxKeys)
  {
    return false;
  }
  keys_[count_] = key;
  ++count_;
  return true;
}

bool KeySet::release(Key key)
{
  for (size_t i = 0; i < count_; ++i)
  {
    if (keys_[i] == key)
    {
      keys_[i] = keys_[count_ - 1];
      --count_;
      return true;
    }
  }
  return false;
}

bool KeySet::contains(Key key) const
{
  for (size_t i = 0; i < count_; ++i)
  {
    if (keys_[i] == key)
    {
      return true;
    }
  }
  return false;
}

bool KeySet::mergeFrom(const KeySet &other)
{
  bool ok = true;
  for (size_t i = 0; i < other.count_; ++i)
  {
    if (!press(other.keys_[i]))
    {
      ok = false;
    }
  }
  return ok;
}

size_t KeySet::count() const
{
  return count_;
}

Key KeySet::at(size_t index) const
{
  if (index >= count_)
  {
    return Key();
  }
  return keys_[index];
}

uint8_t KeySet::keyboardModifierMask() const
{
  uint8_t mask = 0;
  for (size_t i = 0; i < count_; ++i)
  {
    mask |= esp32keybridge::keyboardModifierMask(keys_[i]);
  }
  return mask;
}

bool KeySet::pressKeyboardModifiers(uint8_t mask)
{
  bool ok = true;
  for (uint8_t bit = 0; bit < 8; ++bit)
  {
    if ((mask & (1u << bit)) == 0)
    {
      continue;
    }
    if (!press(keyboardModifierFromBitIndex(bit)))
    {
      ok = false;
    }
  }
  return ok;
}

bool TransformConfig::remap(Key from, Key to)
{
  if (!esp32keybridge::isValid(from) || !esp32keybridge::isValid(to))
  {
    return false;
  }
  for (size_t i = 0; i < remapCount_; ++i)
  {
    if (remaps_[i].from == from)
    {
      remaps_[i].to = to;
      return true;
    }
  }
  if (remapCount_ >= MaxRemaps)
  {
    return false;
  }
  remaps_[remapCount_].from = from;
  remaps_[remapCount_].to = to;
  ++remapCount_;
  return true;
}

bool TransformConfig::disable(Key key)
{
  if (!esp32keybridge::isValid(key))
  {
    return false;
  }
  if (isDisabled(key))
  {
    return true;
  }
  if (disabledCount_ >= MaxDisabledKeys)
  {
    return false;
  }
  disabled_[disabledCount_] = key;
  ++disabledCount_;
  return true;
}

void TransformConfig::clear()
{
  remapCount_ = 0;
  disabledCount_ = 0;
}

Key TransformConfig::map(Key key) const
{
  for (size_t i = 0; i < remapCount_; ++i)
  {
    if (remaps_[i].from == key)
    {
      return remaps_[i].to;
    }
  }
  return key;
}

bool TransformConfig::isDisabled(Key key) const
{
  for (size_t i = 0; i < disabledCount_; ++i)
  {
    if (disabled_[i] == key)
    {
      return true;
    }
  }
  return false;
}

bool TransformConfig::empty() const
{
  return remapCount_ == 0 && disabledCount_ == 0;
}

void LayerConfig::setTrigger(Key trigger)
{
  trigger_ = trigger;
}

bool LayerConfig::remap(Key from, Key to)
{
  if (!esp32keybridge::isValid(from) || !esp32keybridge::isValid(to))
  {
    return false;
  }
  for (size_t i = 0; i < remapCount_; ++i)
  {
    if (remaps_[i].from == from)
    {
      remaps_[i].to = to;
      return true;
    }
  }
  if (remapCount_ >= MaxRemaps)
  {
    return false;
  }
  remaps_[remapCount_].from = from;
  remaps_[remapCount_].to = to;
  ++remapCount_;
  return true;
}

void LayerConfig::clear()
{
  trigger_ = Key();
  remapCount_ = 0;
}

bool LayerConfig::enabled() const
{
  return esp32keybridge::isValid(trigger_);
}

Key LayerConfig::trigger() const
{
  return trigger_;
}

Key LayerConfig::map(Key key) const
{
  for (size_t i = 0; i < remapCount_; ++i)
  {
    if (remaps_[i].from == key)
    {
      return remaps_[i].to;
    }
  }
  return key;
}

bool LayerConfig::hasMapping(Key key) const
{
  for (size_t i = 0; i < remapCount_; ++i)
  {
    if (remaps_[i].from == key)
    {
      return true;
    }
  }
  return false;
}

InputConfig &ESP32KeyBridgeConfig::addInputConfig()
{
  if (inputConfigCount_ >= MaxInputConfigs)
  {
    dummyInputConfig_.clear();
    dummyInputConfig_.slot_ = InputConfig::kUnboundSlot;
    return dummyInputConfig_;
  }
  InputConfig &config = inputConfigs_[inputConfigCount_];
  config.clear();
  config.slot_ = static_cast<uint8_t>(inputConfigCount_);
  ++inputConfigCount_;
  return config;
}

LayerConfig &ESP32KeyBridgeConfig::addLayer(Key trigger)
{
  for (size_t i = 0; i < MaxLayers; ++i)
  {
    if (!layers_[i].enabled())
    {
      layers_[i].clear();
      layers_[i].setTrigger(trigger);
      return layers_[i];
    }
  }
  dummyLayer_.clear();
  return dummyLayer_;
}

LayerConfig &ESP32KeyBridgeConfig::layer(size_t index)
{
  if (index >= MaxLayers)
  {
    dummyLayer_.clear();
    return dummyLayer_;
  }
  return layers_[index];
}

const LayerConfig &ESP32KeyBridgeConfig::layer(size_t index) const
{
  if (index >= MaxLayers)
  {
    return dummyLayer_;
  }
  return layers_[index];
}

namespace
{
// Minimal UTF-8 decoder. Returns the number of bytes consumed (0 on an
// invalid sequence) and stores the codepoint.
size_t decodeUtf8(const char *utf8, char32_t &codepoint)
{
  const uint8_t first = static_cast<uint8_t>(utf8[0]);
  if (first < 0x80)
  {
    codepoint = first;
    return 1;
  }
  size_t length = 0;
  char32_t value = 0;
  if ((first & 0xe0) == 0xc0)
  {
    length = 2;
    value = first & 0x1f;
  }
  else if ((first & 0xf0) == 0xe0)
  {
    length = 3;
    value = first & 0x0f;
  }
  else if ((first & 0xf8) == 0xf0)
  {
    length = 4;
    value = first & 0x07;
  }
  else
  {
    return 0;
  }
  for (size_t i = 1; i < length; ++i)
  {
    const uint8_t byte = static_cast<uint8_t>(utf8[i]);
    if ((byte & 0xc0) != 0x80)
    {
      return 0;
    }
    value = (value << 6) | (byte & 0x3f);
  }
  codepoint = value;
  return length;
}
} // namespace

bool ESP32KeyBridgeConfig::textMacro(Key trigger, const char *utf8)
{
  if (!esp32keybridge::isValid(trigger) || utf8 == nullptr)
  {
    return false;
  }

  TextMacro *slot = nullptr;
  for (size_t i = 0; i < textMacroCount_; ++i)
  {
    if (textMacros_[i].trigger == trigger)
    {
      slot = &textMacros_[i];
      break;
    }
  }
  if (slot == nullptr)
  {
    if (textMacroCount_ >= MaxTextMacros)
    {
      return false;
    }
    slot = &textMacros_[textMacroCount_];
  }

