tanakamasayuki/ESP32KeyBridge/src/ESP32KeyBridge.cpp
  TextMacro macro;
  macro.trigger = trigger;
  size_t pos = 0;
  while (utf8[pos] != '\0')
  {
    char32_t codepoint = 0;
    const size_t consumed = decodeUtf8(utf8 + pos, codepoint);
    if (consumed == 0 || macro.length >= TextMacro::MaxLength)
    {
      return false;
    }
    macro.text[macro.length] = codepoint;
    ++macro.length;
    pos += consumed;
  }

  const bool isNew = slot == &textMacros_[textMacroCount_];
  *slot = macro;
  if (isNew)
  {
    ++textMacroCount_;
  }
  return true;
}

const TextMacro *ESP32KeyBridgeConfig::findTextMacro(Key trigger) const
{
  for (size_t i = 0; i < textMacroCount_; ++i)
  {
    if (textMacros_[i].trigger == trigger)
    {
      return &textMacros_[i];
    }
  }
  return nullptr;
}

void ESP32KeyBridgeConfig::setAxisScale(Axis axis, int16_t scale)
{
  axisScales_[static_cast<size_t>(axis)] = scale;
}

int16_t ESP32KeyBridgeConfig::axisScale(Axis axis) const
{
  return axisScales_[static_cast<size_t>(axis)];
}

void ESP32KeyBridgeConfig::clear()
{
  global.clear();
  for (size_t i = 0; i < MaxInputConfigs; ++i)
  {
    inputConfigs_[i].clear();
    inputConfigs_[i].slot_ = InputConfig::kUnboundSlot;
  }
  inputConfigCount_ = 0;
  for (size_t i = 0; i < MaxLayers; ++i)
  {
    layers_[i].clear();
  }
  for (size_t i = 0; i < MaxTextMacros; ++i)
  {
    textMacros_[i] = TextMacro();
  }
  textMacroCount_ = 0;
  for (size_t i = 0; i < kAxisCount; ++i)
  {
    axisScales_[i] = 1;
  }
  layoutConversionToggle = Key();
  hostLayout = KeyboardLayout::enUs();
  deferTypingWhileModifiersHeld = false;
}

namespace
{
int8_t saturateToInt8(int32_t value)
{
  if (value > 127)
  {
    return 127;
  }
  if (value < -127)
  {
    return -127;
  }
  return static_cast<int8_t>(value);
}
} // namespace

void HidKeyboardReport::clear()
{
  modifiers = 0;
  for (size_t i = 0; i < MaxKeys; ++i)
  {
    keys[i] = 0;
  }
  keyCount = 0;
  overflow = false;
}

bool HidKeyboardReport::empty() const
{
  return modifiers == 0 && keyCount == 0;
}

bool HidKeyboardReport::writeBootReport(uint8_t *buffer, size_t size) const
{
  if (buffer == nullptr || size < BootReportSize)
  {
    return false;
  }
  buffer[0] = modifiers;
  buffer[1] = 0;
  for (size_t i = 0; i < MaxKeys; ++i)
  {
    buffer[2 + i] = i < keyCount ? keys[i] : 0;
  }
  return true;
}

void HidKeyboardRolloverReport::clear()
{
  modifiers = 0;
  for (size_t i = 0; i < MaxKeys; ++i)
  {
    keys[i] = 0;
  }
  keyCount = 0;
  overflow = false;
}

bool HidKeyboardRolloverReport::empty() const
{
  return modifiers == 0 && keyCount == 0;
}

bool HidKeyboardRolloverReport::writeReport(uint8_t *buffer, size_t size) const
{
  if (buffer == nullptr || size < ReportSize)
  {
    return false;
  }
  buffer[0] = modifiers;
  for (size_t i = 0; i < MaxKeys; ++i)
  {
    buffer[1 + i] = i < keyCount ? keys[i] : 0;
  }
  return true;
}

void HidConsumerReport::clear()
{
  usage = 0;
  overflow = false;
}

bool HidConsumerReport::empty() const
{
  return usage == 0;
}

bool HidConsumerReport::writeReport(uint8_t *buffer, size_t size) const
{
  if (buffer == nullptr || size < ReportSize)
  {
    return false;
  }
  buffer[0] = static_cast<uint8_t>(usage & 0xff);
  buffer[1] = static_cast<uint8_t>((usage >> 8) & 0xff);
  return true;
}

void HidMouseReport::clear()
{
  buttons = 0;
  x = 0;
  y = 0;
  wheel = 0;
  pan = 0;
  overflow = false;
}

bool HidMouseReport::empty() const
{
  return buttons == 0 && x == 0 && y == 0 && wheel == 0 && pan == 0;
}

int32_t HidMouseReport::applyAxisDelta(Axis axis, int32_t delta)
{
  int8_t *field = nullptr;
  switch (axis)
  {
  case Axis::X:
    field = &x;
    break;
  case Axis::Y:
    field = &y;
    break;
  case Axis::Wheel:
    field = &wheel;
    break;
  case Axis::Pan:
    field = &pan;
    break;
  }
  if (field == nullptr)
  {
    return delta;
  }
  const int32_t total = static_cast<int32_t>(*field) + delta;
  *field = saturateToInt8(total);
  return total - *field;
}

bool HidMouseReport::writeReport(uint8_t *buffer, size_t size) const
{
  if (buffer == nullptr || size < ReportSize)
  {
    return false;
  }
  buffer[0] = buttons;
  buffer[1] = static_cast<uint8_t>(x);
  buffer[2] = static_cast<uint8_t>(y);
  buffer[3] = static_cast<uint8_t>(wheel);
  buffer[4] = static_cast<uint8_t>(pan);
  return true;
}

HidKeyboardReport buildHidKeyboardReport(const KeySet &keys)
{
  HidKeyboardReport report;
  for (size_t i = 0; i < keys.count(); ++i)
  {
    const Key key = keys.at(i);
    if (key.kind != KeyKind::Keyboard)
    {
      continue;
    }
    const uint8_t modifierMask = keyboardModifierMask(key);
    if (modifierMask != 0)
    {
      report.modifiers |= modifierMask;
      continue;
    }
    if (key.code > 0xff)
    {
      continue;
    }
    if (report.keyCount >= HidKeyboardReport::MaxKeys)
    {
      report.overflow = true;
      continue;
    }
    report.keys[report.keyCount] = static_cast<uint8_t>(key.code);
    ++report.keyCount;
  }
  return report;
}

HidKeyboardRolloverReport buildHidKeyboardRolloverReport(const KeySet &keys)
{
  HidKeyboardRolloverReport report;
  for (size_t i = 0; i < keys.count(); ++i)
  {
    const Key key = keys.at(i);
    if (key.kind != KeyKind::Keyboard)
    {
      continue;
    }
    const uint8_t modifierMask = keyboardModifierMask(key);
    if (modifierMask != 0)
    {
      report.modifiers |= modifierMask;
      continue;
    }
    if (key.code > 0xff)
    {
      continue;
    }
    if (report.keyCount >= HidKeyboardRolloverReport::MaxKeys)
    {
      report.overflow = true;
      continue;
    }
    report.keys[report.keyCount] = static_cast<uint8_t>(key.code);
    ++report.keyCount;
  }
  return report;
}

HidConsumerReport buildHidConsumerReport(const KeySet &keys)
{
  HidConsumerReport report;
  for (size_t i = 0; i < keys.count(); ++i)
  {
    const Key key = keys.at(i);
    if (key.kind != KeyKind::Consumer)
    {
      continue;
    }
    if (report.usage != 0)
    {
      report.overflow = true;
      continue;
    }
    report.usage = key.code;
  }
  return report;
}

HidMouseReport buildHidMouseReport(const KeySet &keys)
{
  HidMouseReport report;
  for (size_t i = 0; i < keys.count(); ++i)
  {
    const Key key = keys.at(i);
    if (key.kind != KeyKind::MouseButton)
    {
      continue;
    }
    if (key.code < 1 || key.code > HidMouseReport::MaxButtons)
    {
      report.overflow = true;
      continue;
    }
    report.buttons |= static_cast<uint8_t>(1u << (key.code - 1));
  }
  return report;
}

bool ESP32KeyBridge::addInput(InputAdapter &input)
{
  if (inputCount_ >= MaxInputs)
  {
    return false;
  }
  inputs_[inputCount_] = &input;
  inputConfigSlots_[inputCount_] = InputConfig::kUnboundSlot;
  inputWasConnected_[inputCount_] = false; // first update pushes the lock state
  ++inputCount_;
  return true;
}

bool ESP32KeyBridge::addInput(InputAdapter &input, const InputConfig &inputConfig)
{
  if (!addInput(input))
  {
    return false;
  }
  inputConfigSlots_[inputCount_ - 1] = inputConfig.slot_;
  return true;
}

const InputConfig *ESP32KeyBridge::perInputConfig(size_t inputIndex) const
{
  const uint8_t slot = inputConfigSlots_[inputIndex];
  if (slot >= ESP32KeyBridgeConfig::MaxInputConfigs)
  {
    return nullptr;
  }
  return &config_.inputConfigs_[slot];
}

