tanakamasayuki/ESP32KeyBridge/src/ESP32KeyBridge.cpp
void ESP32KeyBridge::clearInputs()
{
  inputCount_ = 0;
  heldCount_ = 0;
  for (size_t i = 0; i < ESP32KeyBridgeConfig::MaxLayers; ++i)
  {
    layerHoldCounts_[i] = 0;
  }
  merged_.clear();
  output_.clear();
  mergedOverflow_ = false;
  outputOverflow_ = false;
  for (size_t i = 0; i < 3; ++i)
  {
    prevLockKeyPressed_[i] = false;
  }
}

size_t ESP32KeyBridge::inputCount() const
{
  return inputCount_;
}

bool ESP32KeyBridge::addOutput(OutputAdapter &output)
{
  if (outputCount_ >= MaxOutputs)
  {
    return false;
  }
  outputs_[outputCount_] = &output;
  ++outputCount_;
  return true;
}

void ESP32KeyBridge::clearOutputs()
{
  outputCount_ = 0;
  lockAuthorityPresent_ = false;
}

size_t ESP32KeyBridge::outputCount() const
{
  return outputCount_;
}

bool ESP32KeyBridge::validateConfig(const ESP32KeyBridgeConfig &config,
                                    ESP32KeyBridgeConfigError &error) const
{
  (void)config;
  error.message = nullptr;
  return true;
}

void ESP32KeyBridge::applyConfig(const ESP32KeyBridgeConfig &config)
{
  // Held presses keep their press-time resolution; only new presses see the
  // new configuration.
  config_ = config;
}

size_t ESP32KeyBridge::findHeld(uint8_t inputIndex, Key source) const
{
  for (size_t i = 0; i < heldCount_; ++i)
  {
    if (held_[i].inputIndex == inputIndex && held_[i].source == source)
    {
      return i;
    }
  }
  return MaxHeldKeys;
}

void ESP32KeyBridge::removeHeld(size_t index)
{
  for (uint8_t layer = 0; layer < ESP32KeyBridgeConfig::MaxLayers; ++layer)
  {
    if ((held_[index].layerTriggerMask & (1u << layer)) != 0 && layerHoldCounts_[layer] > 0)
    {
      --layerHoldCounts_[layer];
    }
  }
  held_[index] = held_[heldCount_ - 1];
  --heldCount_;
}

uint8_t ESP32KeyBridge::layerTriggerMaskFor(Key key) const
{
  uint8_t mask = 0;
  for (uint8_t layer = 0; layer < ESP32KeyBridgeConfig::MaxLayers; ++layer)
  {
    const LayerConfig &config = config_.layer(layer);
    if (config.enabled() && config.trigger() == key)
    {
      mask |= static_cast<uint8_t>(1u << layer);
    }
  }
  return mask;
}

Key ESP32KeyBridge::applyLayerOverlay(Key key) const
{
  for (uint8_t layer = 0; layer < ESP32KeyBridgeConfig::MaxLayers; ++layer)
  {
    if (layerHoldCounts_[layer] == 0)
    {
      continue;
    }
    const LayerConfig &config = config_.layer(layer);
    if (config.hasMapping(key))
    {
      return config.map(key);
    }
  }
  return key;
}

void ESP32KeyBridge::resolvePress(uint8_t inputIndex, Key source, bool triggersOnly)
{
  const InputConfig *perInput = perInputConfig(inputIndex);

  Key key = source;
  bool converted = false;
  bool requiresShift = false;
  bool dropped = false;       // conversion produced an untypable character
  bool shiftConsumed = false; // Shift of a converting input, used for decode

  // Layout conversion runs first, on the raw physical key of the engraving.
  if (layoutConversionEnabled_ && perInput != nullptr && perInput->convertsLayout() &&
      source.kind == KeyKind::Keyboard)
  {
    const KeySet &inputKeys = inputs_[inputIndex]->keys();
    const Key leftShift = keyboardKey(KeyboardUsage::LeftShift);
    const Key rightShift = keyboardKey(KeyboardUsage::RightShift);
    if (source == leftShift || source == rightShift)
    {
      shiftConsumed = true;
    }
    else
    {
      // Shortcut rule: keys pressed while Ctrl/Alt/GUI is held on the same
      // input pass through unconverted (position semantics).
      const bool shortcut = inputKeys.contains(keyboardKey(KeyboardUsage::LeftCtrl)) ||
                            inputKeys.contains(keyboardKey(KeyboardUsage::RightCtrl)) ||
                            inputKeys.contains(keyboardKey(KeyboardUsage::LeftAlt)) ||
                            inputKeys.contains(keyboardKey(KeyboardUsage::RightAlt)) ||
                            inputKeys.contains(keyboardKey(KeyboardUsage::LeftGui)) ||
                            inputKeys.contains(keyboardKey(KeyboardUsage::RightGui));
      if (!shortcut)
      {
        const bool shifted = inputKeys.contains(leftShift) || inputKeys.contains(rightShift);
        const char32_t codepoint = perInput->engraving().decode(source, shifted);
        if (codepoint != 0)
        {
          KeyStroke stroke;
          if (config_.hostLayout.encode(codepoint, stroke))
          {
            key = stroke.key;
            requiresShift = stroke.shift;
            converted = true;
          }
          else
          {
            // The host layout cannot type this character (e.g. Yen on
            // en_us): drop the press, never emit a wrong key.
            converted = true;
            dropped = true;
          }
        }
      }
    }
  }

  bool disabled = false;
  uint8_t triggerMask = 0;
  if (!shiftConsumed && !dropped)
  {
    if (!converted && perInput != nullptr)
    {
      key = perInput->transform().map(key);
      disabled = perInput->transform().isDisabled(key);
    }
    if (!disabled)
    {
      key = config_.global.map(key);
      triggerMask = layerTriggerMaskFor(key);
    }
  }

  if (triggersOnly && triggerMask == 0)
  {
    return;
  }

  if (heldCount_ >= MaxHeldKeys)
  {
    outputOverflow_ = true;
    return;
  }

  HeldKey &entry = held_[heldCount_];
  entry.inputIndex = inputIndex;
  entry.source = source;
  entry.resolved = Key();
  entry.layerTriggerMask = triggerMask;
  entry.converted = converted;
  entry.requiresShift = converted && requiresShift;

  // Side effects live below the triggersOnly gate so the two press passes
  // cannot double-apply them.
  if (dropped)
  {
    ++layoutConvertFailCount_;
  }

  if (triggerMask != 0)
  {
    // Layer triggers are consumed and never emitted.
    for (uint8_t layer = 0; layer < ESP32KeyBridgeConfig::MaxLayers; ++layer)
    {
      if ((triggerMask & (1u << layer)) != 0)
      {
        ++layerHoldCounts_[layer];
      }
    }
  }
  else if (!disabled && !shiftConsumed && !dropped)
  {
    if (esp32keybridge::isValid(config_.layoutConversionToggle) &&
        key == config_.layoutConversionToggle)
    {
      // Consumed; toggles conversion for new presses only (held keys keep
      // their press-time resolution).
      layoutConversionEnabled_ = !layoutConversionEnabled_;
    }
    else
    {
      const TextMacro *macro = config_.findTextMacro(key);
      if (macro != nullptr)
      {
        // Text macro triggers are consumed; the press enqueues the text.
        enqueueMacro(*macro);
      }
      else
      {
        key = applyLayerOverlay(key);
        if (!config_.global.isDisabled(key))
        {
          entry.resolved = key;
        }
      }
    }
  }

  ++heldCount_;
}

void ESP32KeyBridge::update()
{
  outputOverflow_ = false;

  for (size_t i = 0; i < inputCount_; ++i)
  {
    inputs_[i]->update();
  }

  // Releases first: a trigger released and a key pressed in the same update
  // resolve without the layer.
  for (size_t i = heldCount_; i > 0; --i)
  {
    const HeldKey &entry = held_[i - 1];
    const InputAdapter *input = inputs_[entry.inputIndex];
    if (!input->connected() || !input->keys().contains(entry.source))
    {
      removeHeld(i - 1);
    }
  }

  // Presses in two passes: layer triggers first, then everything else, so a
  // trigger and a target key arriving in the same update apply the layer.
  for (int pass = 0; pass < 2; ++pass)
  {
    const bool triggersOnly = pass == 0;
    for (size_t i = 0; i < inputCount_; ++i)
    {
      if (!inputs_[i]->connected())
      {
        continue;
      }
      const KeySet &keys = inputs_[i]->keys();
      for (size_t k = 0; k < keys.count(); ++k)
      {
        Key source = keys.at(k);
        if (findHeld(static_cast<uint8_t>(i), source) != MaxHeldKeys)
        {
          continue;
        }
        resolvePress(static_cast<uint8_t>(i), source, triggersOnly);
      }
    }
  }

  merged_.clear();
  mergedOverflow_ = false;
  for (size_t i = 0; i < inputCount_; ++i)
  {
    if (!inputs_[i]->connected())
    {
      continue;
    }
    if (!merged_.mergeFrom(inputs_[i]->keys()))
    {
      mergedOverflow_ = true;
    }
  }

  output_.clear();
  bool synthesizeShift = false;
  for (size_t i = 0; i < heldCount_; ++i)
  {
    if (!esp32keybridge::isValid(held_[i].resolved))
    {
      continue;
    }
    if (!output_.press(held_[i].resolved))
    {
      outputOverflow_ = true;
    }
    if (held_[i].requiresShift)
    {
      synthesizeShift = true;
    }
  }
  if (synthesizeShift)
  {
    output_.press(keyboardKey(KeyboardUsage::LeftShift));
  }

  // A converting input's Shift keys are consumed for decoding, but while a
  // non-converted key of that input is held (arrows, shortcuts), its real
  // Shift passes through so Shift+Arrow selection works.
  for (size_t i = 0; i < inputCount_; ++i)
  {
    const InputConfig *perInput = perInputConfig(i);
    if (!inputs_[i]->connected() || !layoutConversionEnabled_ ||
        perInput == nullptr || !perInput->convertsLayout())
    {
      continue;
    }
    const KeySet &inputKeys = inputs_[i]->keys();
    const bool physLeft = inputKeys.contains(keyboardKey(KeyboardUsage::LeftShift));
    const bool physRight = inputKeys.contains(keyboardKey(KeyboardUsage::RightShift));
    if (!physLeft && !physRight)
    {
      continue;
    }
    for (size_t h = 0; h < heldCount_; ++h)
    {
      const HeldKey &entry = held_[h];
      if (entry.inputIndex != i || entry.converted || !esp32keybridge::isValid(entry.resolved) ||
          entry.resolved.kind != KeyKind::Keyboard || isKeyboardModifier(entry.resolved))
      {
        continue;
      }
      if (physLeft)
      {
        output_.press(keyboardKey(KeyboardUsage::LeftShift));
      }
      if (physRight)
      {
        output_.press(keyboardKey(KeyboardUsage::RightShift));
      }
      break;
    }
  }

