tanakamasayuki/ESP32KeyBridge/src/ESP32KeyBridge.cpp
  stepTyping();
  updateAxes();
  updateLockState();

  for (size_t i = 0; i < outputCount_; ++i)
  {
    if (outputs_[i]->connected())
    {
      outputs_[i]->write(output_);
    }
  }
}

bool ESP32KeyBridge::enqueueChar(char32_t codepoint)
{
  // CRLF is normalized to a single Enter at the enqueue edge.
  const bool skipLF = codepoint == '\n' && lastEnqueuedCR_;
  lastEnqueuedCR_ = codepoint == '\r';
  if (skipLF)
  {
    return true;
  }
  if (textCount_ >= MaxTextQueue)
  {
    ++textOverflowCount_;
    return false;
  }
  textQueue_[(textHead_ + textCount_) % MaxTextQueue] = codepoint;
  ++textCount_;
  return true;
}

bool ESP32KeyBridge::typeChar(char32_t codepoint)
{
  return enqueueChar(codepoint);
}

size_t ESP32KeyBridge::typeText(const char *utf8)
{
  if (utf8 == nullptr)
  {
    return 0;
  }
  size_t pos = 0;
  while (utf8[pos] != '\0')
  {
    char32_t codepoint = 0;
    const size_t consumed = decodeUtf8(utf8 + pos, codepoint);
    if (consumed == 0)
    {
      // Invalid byte: consume and count it so a resume loop always makes
      // progress.
      ++textEncodeFailCount_;
      ++pos;
      continue;
    }
    if (textCount_ >= MaxTextQueue)
    {
      // Full: stop without dropping. The caller resumes at utf8 + pos.
      // (A CRLF-collapsed LF pending here is still handled correctly on
      // resume because lastEnqueuedCR_ is untouched until then.)
      break;
    }
    enqueueChar(codepoint);
    pos += consumed;
  }
  return pos;
}

void ESP32KeyBridge::enqueueMacro(const TextMacro &macro)
{
  for (size_t i = 0; i < macro.length; ++i)
  {
    enqueueChar(macro.text[i]);
  }
}

bool ESP32KeyBridge::encodeCharForTyping(char32_t codepoint, KeyStroke &stroke) const
{
  switch (codepoint)
  {
  case '\t':
    stroke.key = keyboardKey(KeyboardUsage::Tab);
    stroke.shift = false;
    return true;
  case '\n':
  case '\r':
    stroke.key = keyboardKey(KeyboardUsage::Enter);
    stroke.shift = false;
    return true;
  case 0x08:
    stroke.key = keyboardKey(KeyboardUsage::Backspace);
    stroke.shift = false;
    return true;
  case 0x1b:
    stroke.key = keyboardKey(KeyboardUsage::Escape);
    stroke.shift = false;
    return true;
  default:
    break;
  }
  if (codepoint < 0x20 || codepoint == 0x7f)
  {
    return false;
  }
  if (!config_.hostLayout.encode(codepoint, stroke))
  {
    return false;
  }
  // Caps Lock compensation against the lock state shadow.
  if (lockState_.capsLock && config_.hostLayout.capsAffects(stroke.key))
  {
    stroke.shift = !stroke.shift;
  }
  return true;
}

void ESP32KeyBridge::stepTyping()
{
  // The user's keyboard modifier state before any suppression: used for the
  // defer option and restored automatically once typing goes idle.
  const uint8_t userModifiers = output_.keyboardModifierMask();

  if (!typingActive_)
  {
    if (textCount_ == 0)
    {
      return;
    }
    if (config_.deferTypingWhileModifiersHeld && userModifiers != 0)
    {
      return;
    }
    // Consume characters until one produces a stroke. Every consumed
    // character is delivered to text-native outputs, even unencodable ones.
    while (textCount_ > 0 && !typingActive_)
    {
      const char32_t codepoint = textQueue_[textHead_];
      textHead_ = (textHead_ + 1) % MaxTextQueue;
      --textCount_;
      for (size_t i = 0; i < outputCount_; ++i)
      {
        if (outputs_[i]->connected())
        {
          outputs_[i]->writeText(codepoint);
        }
      }
      KeyStroke stroke;
      if (encodeCharForTyping(codepoint, stroke))
      {
        typingStroke_ = stroke;
        typingPhase_ = 0;
        typingActive_ = true;
      }
      else
      {
        ++textEncodeFailCount_;
      }
    }
    if (!typingActive_)
    {
      return;
    }
  }

  // One atomic character frame, one phase per update: (0) modifiers only,
  // (1) modifiers + key, (2) modifiers only. User-held keyboard modifiers
  // are parked during the frame and reappear when typing goes idle.
  KeySet result;
  for (size_t i = 0; i < output_.count(); ++i)
  {
    const Key key = output_.at(i);
    if (isKeyboardModifier(key))
    {
      continue;
    }
    result.press(key);
  }
  if (typingStroke_.shift)
  {
    result.press(keyboardKey(KeyboardUsage::LeftShift));
  }
  if (typingPhase_ == 1)
  {
    result.press(typingStroke_.key);
  }
  output_ = result;

  ++typingPhase_;
  if (typingPhase_ >= 3)
  {
    typingActive_ = false;
  }
}

void ESP32KeyBridge::updateAxes()
{
  for (size_t axis = 0; axis < kAxisCount; ++axis)
  {
    int32_t total = 0;
    for (size_t i = 0; i < inputCount_; ++i)
    {
      // Drain disconnected inputs too so stale deltas are not replayed on
      // reconnect, but only connected inputs contribute.
      const int32_t delta = inputs_[i]->takeAxisDelta(static_cast<Axis>(axis));
      if (inputs_[i]->connected())
      {
        total += delta;
      }
    }
    total *= config_.axisScale(static_cast<Axis>(axis));
    axisDeltas_[axis] = total;
    if (total == 0)
    {
      continue;
    }
    for (size_t i = 0; i < outputCount_; ++i)
    {
      if (outputs_[i]->connected())
      {
        outputs_[i]->writeAxisDelta(static_cast<Axis>(axis), total);
      }
    }
  }
}

size_t ESP32KeyBridge::textQueueLength() const
{
  return textCount_;
}

size_t ESP32KeyBridge::typeAvailable() const
{
  return MaxTextQueue - textCount_;
}

bool ESP32KeyBridge::typingActive() const
{
  return typingActive_;
}

uint32_t ESP32KeyBridge::textOverflowCount() const
{
  return textOverflowCount_;
}

uint32_t ESP32KeyBridge::textEncodeFailCount() const
{
  return textEncodeFailCount_;
}

int32_t ESP32KeyBridge::axisDelta(Axis axis) const
{
  return axisDeltas_[static_cast<size_t>(axis)];
}

void ESP32KeyBridge::setLayoutConversionEnabled(bool enabled)
{
  layoutConversionEnabled_ = enabled;
}

bool ESP32KeyBridge::layoutConversionEnabled() const
{
  return layoutConversionEnabled_;
}

uint32_t ESP32KeyBridge::layoutConvertFailCount() const
{
  return layoutConvertFailCount_;
}

